# 这是一个示例 Python 脚本。

# 按 Shift+F10 执行或将其替换为您的代码。
# 按 双击 Shift 在所有地方搜索类、文件、工具窗口、操作和设置。


def main():
    print()

# 退出省电模式
# 点击进入魔方阵
# 判断有无次数
    # 判断无次数，无次数进行下面的操作
        # 判断是否自动挖矿
            #在自动挖矿则进入省电模式
        #   没有挖矿
            # 自动进入地图并挖矿
    # 判断有次数，有次数进行下面的操作
        # 确认点击进入魔方阵
        # 进入后点击自动增加次数
        #循环判断是否死亡
            # 是则复活
                #复活
                # 复活后判断是否免费自动增加次数
                    #免费则增加一次
                    #不免费关闭
                # 循环判断是否在某个屋子
                    #不是则点击移动
                    #是则点击自动挖矿
                    #重新截图判断是否死亡，重置死亡可信度
            # 没有死亡则循环判断是否在某个屋子
                #不是在这个屋子则点击移动
                #是则点击自动挖矿

if __name__ == '__main__':
    main()

# 访问 https://www.jetbrains.com/help/pycharm/ 获取 PyCharm 帮助
